app/Controllers/Practicas.php

    public function index()
    {
        $modelo = new PracticaModel();
        $data['practicas'] = $modelo->findAll();
---
SELECT *
FROM `practicas`

    public function eliminar($id)
    {
        $modelo = new PracticaModel();
        if ($modelo->delete($id)) {
---
DELETE FROM `practicas`
WHERE `id` IN ('3')